# Создайте переменные разных типов данных:
#   - Создайте переменную name и присвойте ей значение вашего имени (строка).
name = "Василий"

#   - Выведите значение переменной name на экран.
print(f"Name: {name}")

#   - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
age = 42

#   - Выведите значение переменной age на экран.
print(f"Age: {age}")

#   - Перезапишите в age текущее значение переменной age + новое.
age = age + 1

#   - Выведите измененное значение переменной age на экран.
print(f"New age: {age}")

#   - Создайте переменную is_student и присвойте ей значение True (логическое значение).
is_student = True

#   - Выведите значение переменной is_student на экран.
print(f"Is Student: {is_student}")
